# ДЗ:
# 1. Создать функцию, которая выводит на экран цифру, введенную пользоватлем в консоли.


# 2. Написать программу, которая считает 5 значений, введенных пользователем из консоли, сохранит их в список
#    затем передаст значения в фукцию, которая выводит на экран сумму значений списка.


# 3. Написать программу, которая:
#       - выводит следующее меню на экран
#           1. Ввести значения а и b
#           2. Умножить значения а и b
#           3. Делить а на b
#           4. Выход
#       - реализует кажду опцию как фукцию.
#       - реализует все ошибки и исключения.

# pre: должны быть заданы 3 цифровых значения.
# post: вернется одна цифровое значение, вычисленное по формуле myInt * myInt2 + myInt3.

def myFunction(myInt, myInt2, myInt3):
    return myInt * myInt2 + myInt3



print(a)
